<a href="https://colab.research.google.com/github/Nourankh20/Data-Visualization/blob/nouran/Visualization.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
def get_path(dataset_name,env_name='colab'):
    """
    This function is used to return the path of the dataset you want to use. 
    
    @params:
    dataset_name: the name of the dataset. 
    env_name: it has two values either local, or colab the default is colab
    """
    prefix = 'https://raw.githubusercontent.com/Nourankh20/Data-Visualization/main/datasets/'
    if env_name == 'colab':
        return prefix+dataset_name
    else:
        return f'../datasets/{dataset_name}'

In [2]:
athlete_events_df =  pd.read_csv(get_path('athlete_events.csv'))

In [3]:
athlete_events_df.head()

   ID                      Name  ...                             Event  Medal
0   1                 A Dijiang  ...       Basketball Men's Basketball    NaN
1   2                  A Lamusi  ...      Judo Men's Extra-Lightweight    NaN
2   3       Gunnar Nielsen Aaby  ...           Football Men's Football    NaN
3   4      Edgar Lindenau Aabye  ...       Tug-Of-War Men's Tug-Of-War   Gold
4   5  Christine Jacoba Aaftink  ...  Speed Skating Women's 500 metres    NaN

[5 rows x 15 columns]

In [4]:
noc_regions = pd.read_csv(get_path('noc_regions.csv'))

In [5]:
noc_regions.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

Merging the 2 datasets into one dataset called df

In [36]:
df = pd.merge(athlete_events_df,noc_regions,left_on='NOC',right_on='NOC')

In [37]:
df.head()

     ID           Name Sex  ...  Medal  region  notes
0     1      A Dijiang   M  ...    NaN   China    NaN
1     2       A Lamusi   M  ...    NaN   China    NaN
2   602  Abudoureheman   M  ...    NaN   China    NaN
3  1463      Ai Linuer   M  ...    NaN   China    NaN
4  1464      Ai Yanhan   F  ...    NaN   China    NaN

[5 rows x 17 columns]

In [38]:
null_values_percentages = df.isna().sum()/len(df) *100
null_values_percentages

ID         0.000000
Name       0.000000
Sex        0.000000
Age        3.494517
Height    22.189927
Weight    23.187833
Team       0.000000
NOC        0.000000
Games      0.000000
Year       0.000000
Season     0.000000
City       0.000000
Sport      0.000000
Event      0.000000
Medal     85.310618
region     0.007756
notes     98.138990
dtype: float64

In [52]:
#to get the mean of data for the nan data we separated the data by region and sex of athlete

Clustered_on_Females= df[df['Sex']=='F']
Clustered_on_Males=df[df['Sex']=='M']

Clustered_on_region_Female= Clustered_on_Females.groupby(Clustered_on_Females['region'])
mean_regions_females=Clustered_on_region_Female.mean()

mean_regions_females[mean_regions.index=='Algeria']

Clustered_on_region_Male= Clustered_on_Males.groupby(Clustered_on_Males['region'])
mean_regions_males=Clustered_on_region_Male.mean()

mean_regions_males[mean_regions.index=='Algeria']

                   ID        Age    Height     Weight         Year
region
Algeria  49280.426696  24.476718  176.3725  70.755611  1996.148796